// Copyright (c) 2011 The Chromium OS Authors. Všetky práva vyhradené.
// Na použitie tohto zdrojového kódu sa vzťahuje licencia typu BSD, ktorú môžete
// nájsť v súbore LICENSE.

/* Menus */
"Menu About" = "O aplikácii Chrome OS Image Creator";
"Menu Prefs" = "Predvoľby..";
"Menu Services" = "Služby";
"Menu Hide" = "Skryť aplikáciu Chrome OS Image Creator";
"Menu Hide Others" = "Skryť ostatné";
"Menu Show All" = "Zobraziť všetko";
"Menu Quit" = "Ukončiť aplikáciu Chrome OS Image Creator";
"Menu Window" = "Okno";
"Menu Minimize" = "Minimalizovať";
"Menu Zoom" = "Lupa";
"Menu Bring All To Front" = "Preniesť všetko dopredu";
"Menu Help" = "Pomocník";
"Menu App Help" = "Pomocník aplikácie Chrome OS Image Creator";

/* Buttons */
"Button Previous" = "Predchádzajúca";
"Button Next" = "Ďalšia";
"Button Stop" = "Zastaviť";
"Button Done" = "Hotovo";

/* Tab: Select device model */
"Text Welcome" = "Vitajte v aplikácii Chrome OS Image Creator. Vyberte model zariadenia so systémom Chrome OS.";
"Button Local Image" = "Miestny obraz…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Vyberte pamäťový kľúč USB, ktorý chcete použiť na obnovenie:";
"Text Insertion Prompt" = "Vložte pamäťový kľúč USB.";

/* Tab: Done */
"Text Congrats" = "Gratulujeme k vytvoreniu spúšťacej jednotky na obnovenie počítača so systémom Chrome OS. Odstráňte ju z počítača a použite na obnovenie poškodeného operačného systému Chromebooku.";

/* Sizes */
"Size Bytes" = " B";
"Size Kilobytes" = " kB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Pri spúšťaní arbitrácie disku došlo k chybe. */
"NoDiskArb Message" = "Táto aplikácia sa nemôže spustiť.";
"NoDiskArb Informative" = "Pri spúšťaní arbitrácie disku sa vyskytla chyba. K tomuto nemalo dôjsť.";
"NoDiskArb OK" = "OK";

/* Pri získavaní súboru s konfiguráciou došlo k chybe. */
"CantGetConfig Message" = "Nepodarilo sa získať zoznam obrazov.";
"CantGetConfig Informative" = "Pri získavaní zoznamu dostupných obrazov na obnovenie sa vyskytol problém (%1$@). Skontrolujte funkčnosť sieťového pripojenia.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "pripojenie sa nepodarilo nájsť";
"CantGetConfig Error DownloadError" = "počas preberania došlo k chybe";
"CantGetConfig Error StringCreate" = "odpoveď sa nedá použiť";

/* Chyba verzie. */
"VersionError Message" = "Táto verzia aplikácie je príliš stará.";
"VersionError Informative" = "Prevezmite novšiu verziu. Toto je verzia %1$@; požaduje sa verzia %2$@ alebo novšia. %3$@";
"VersionError OK" = "Získať novú verziu";

/* Dialógové okno na výber miestneho súboru. */
"SelectLocal File" = "Vyberte obraz:";
"SelectLocal Button" = "Vybrať";

/* Upozornenie na zapisovateľný kľúč. */
"WriteAlert Message" = "Naozaj chcete natrvalo vymazať jednotku %1$@?";
"WriteAlert Informative" = "Všetky údaje, ktoré sa na nej momentálne nachádzajú, budú natrvalo stratené. Táto operácia sa nedá vrátiť späť.";
"WriteAlert Cancel" = "Nevymazať";
"WriteAlert OK" = "Vymazať";

"TooSmallAlert Message" = "Kľúč %1$@ sa nedá použiť, je príliš malý.";
"TooSmallAlert Informative" = "Vyžaduje sa jednotka s veľkosťou aspoň %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Kľúč %1$@ sa nedá použiť; je iba na čítanie.";
"NotWritable Informative" = "Kľúč je iba na čítanie. Na kľúči by mal byť prepínač umožňujúci zápis; v opačnom prípade tento kľúč nemôžete použiť.";
"NotWritable OK" = "OK";

/* Stavy zápisu na kľúč. */
"Status Downloading" = "Prebieha preberanie…";
"Status Verifying" = "Prebieha overovanie…";
"Status Unpacking" = "Prebieha rozbaľovanie…";
"Status Claiming" = "Posielanie požiadavky…";
"Status Unmounting" = "Prebieha odpájanie…";
"Status Writing" = "Prebieha zápis…";
"Status Ejecting" = "Prebieha vysúvanie…";
"Status Done" = "Hotovo.";

"StatusAdd Attempt" = " (pokus %1$d)";

/* Chyby */
"Failure Downloading" = "Ľutujeme, došlo k chybe (prevzatie zdrojového obrazu zlyhalo). Chcete to skúsiť znova?";
"Failure Verifying Return Value" = "Ľutujeme, došlo k chybe (overenie zdrojového obrazu zlyhalo, zlyhanie programu, %1$s). Chcete to skúsiť znova?";
"Failure Verifying SHA Mismatch" = "Ľutujeme, došlo k chybe (overenie zdrojového obrazu zlyhalo, zlyhanie kontrolného súčtu). Chcete to skúsiť znova?";
"Failure Unpacking" = "Ľutujeme, došlo k chybe (rozbalenie zdrojového obrazu zlyhalo, %1$s). Chcete to skúsiť znova?";
"Failure Claiming" = "Ľutujeme, došlo k chybe (odoslanie požiadavky na USB kľúč zlyhalo). Chcete to skúsiť znova?";
"Failure Unmounting" = "Ľutujeme, došlo k chybe (odpojenie USB kľúča zlyhalo). Chcete to skúsiť znova?";
"Failure Opening Source Image" = "Ľutujeme, došlo k chybe (otvorenie zdrojového obrazu zlyhalo, %1$s). Chcete to skúsiť znova?";
"Failure Opening Destination Device" = "Ľutujeme, došlo k chybe (otvorenie USB kľúča zlyhalo, %1$s). Chcete to skúsiť znova?";
"Failure Reading Source Image" = "Ľutujeme, došlo k chybe (čítanie zo zdrojového obrazu zlyhalo, %1$s). Chcete to skúsiť znova?";
"Failure Writing Destination Device" = "Ľutujeme, došlo k chybe (zápis údajov na USB kľúč zlyhal, %1$s). Chcete to skúsiť znova?";
"Failure Ejecting" = "Ľutujeme, došlo k chybe (vysunutie USB kľúča zlyhalo). Chcete to skúsiť znova?";

"Failure Try Again" = "Skúsiť znova";
"Failure Quit" = "Ukončiť";

"Failure Termination Status" = "Stav ukončenia %d";

"Failure Internal Error 1" = "Nečakaný koniec súboru";
